Table of Contents
Namespace IdeaStatiCa.Plugin.ProjectContent
 Classes
ProjectContentClientHandler
Implementation of IdeaStatiCa.Public.IProjectContent for accessing project data of using grpc
ProjectContentServerHandler
Responsible for accessing to data of a project
RemoteDataStream
MemoryStream which data are copied to IProjectContentStorage when method in Flush or Close is called and local data are changed
 Interfaces
IProjectContentStorage
Storage of project items